[
    {
        "id": "hacktues",
        "winners": [
            {
                "place": "first",
                "participants": "Телерик Арсов, Антонио Милев, Мартин Дацев",
                "name": "Go6o",
                "project": "Автоматизирана оценка на тестове",
                "image": "https://firebasestorage.googleapis.com/v0/b/hack-tues.appspot.com/o/ht_archive%2Fht%2Fht-1.jpg?alt=media&token=a117c3ae-7168-4cbd-84d1-59e48cdaa4ff"
            },
            {
                "place": "second",
                "participants": "Антонио Миндов, Дария Никитова, Кристиана Иванова, Петър Петров, Ясен Алексиев",
                "name": "R&T",
                "project": "Визуализация на код с блок-схеми",
                "image": "https://firebasestorage.googleapis.com/v0/b/hack-tues.appspot.com/o/ht_archive%2Fht%2Fht-2.jpg?alt=media&token=88bef65d-f596-44ed-993e-842b7090530e"
            },
            {
                "place": "third",
                "participants": "Габриел Гарвалов, Дейвид-Николас Петров, Илиян Кордев, Филип Пепегов, Кристиан Томов",
                "name": "Coding Masters",
                "project": "Система за обмен на информация и знания между учениците",
                "image": "https://firebasestorage.googleapis.com/v0/b/hack-tues.appspot.com/o/ht_archive%2Fht%2Fht-3.jpg?alt=media&token=32983808-86ce-4f23-82ea-a7a8064afb6e"
            }
        ],
        "allParticipants": 84,
        "teams": 18,
        "valuedProjects": 6,
        "description": "Трима осмокласници от столичното Технологично училище Електронни системи (ТУЕС) спечелиха голямата награда в първия ученически хакатон HackTUES, организиран по инициатива на ученици от ТУЕС.\n     Проектът за система за автоматизирана оценка на тестове, на основата на технология за разпознаване на изображения, донесе първата награда в състезанието на Телерик Арсов, Антонио Милев и Мартин Дацев (отбор Go6o). Освен купа ТУЕС и грамоти, тримата получиха възможност за двуседмична практика в Nemetschek България, безплатно обучение за първия модул Fundamentals на SoftUni, както и специалната награда от ChaosGroup.\n     На второ място се класираха учениците от отбор R&T с проект за визуализация на код с блок-схеми. Те получиха и специални награди от MusalaSoft и StandByte.\n     Третата награда в хакатона беше отредена за отбор Coding Masters с проект за система за обмен на информация и знания между учениците. Наградата за оригинална идея беше връчена на отбор P2W за проекта им за забавна електронна игра с образователни въпроси. Проектът на отбор TANKK Crew за онлайн компилатор и система за проверка на задачи беше отличен с награда за най-добро представяне и с награда от HackBulgaria. Nemetschek България връчиха още една специална награда на отбор Няма значение за проекта им за електронен дневник. Всички 18 отбора получиха сертификати за успешно участие.\n     Хакатонът е нов вид състезание, което събира на едно място много участници от ИТ сферата, които работят в продължение на три дни върху разрешаването на конкретен казус. В първия ученически хакатон с тема „Автоматизация и подобряване на учебния процес“ участваха над 80 ученика от 8 до 12 клас на Технологично училище Електронни системи. Целта на HackTUES е да допринесе за модернизиране на учебния процес в училището, както и да даде възможност на ученици от различни класове да придобият практически опит в създаването на софтуер, работата в екип и в подкрепата на обществени каузи. Ментори на отборите и членове на журито са както преподаватели от училището, така и представители на различни компании, работещи в сферата на информационните технологии. Инициативата беше подкрепена от SoftUni, HackBulgaria, MusalaSoft, ChaosGroup, Astea, Nemetschek, StandByteи Subway. Идеята за състезанието идва от ученици от 10-ти клас в ТУЕС и среща подкрепата на ръководството на училището.\n„Станахме свидетели на едно изключително интересно състезание и се убедихме, че учениците имат много идеи. Наша задача е да създаваме възможности тези идеи да видят бял свят. Хакатонът е една чудесна възможност за това и съм убедена, че той ще се превърне в традиция за ТУЕС.“\nдоц. д-р инж. Стела Стефанова, директор на ТУЕС"
    },
    {
        "id": "hacktues2",
        "winners": [
            {
                "place": "first",
                "participants": "Жанет Хаджиангелова, Мария Стоянова, Георги Данчев, Николай Миланов, Димитър Кацаров",
                "name": "ASDF Unicorns",
                "project": "Образователна игра за опазване на околната среда"
            },
            {
                "place": "second",
                "participants": "Николета Далакчиева, Владимир Младенов, Марина Тихова, Лъчезар Младенов",
                "name": "Walking Chaos",
                "project": "Уебсайт за продажба и обмен на продукти от рециклирани материали"
            },
            {
                "place": "third",
                "participants": "Андреа Георгиева, Николай Рангелов, Александър Велинов, Калин Карев, Светлин Йорданов, Теодор Добрев",
                "name": "The Tanks",
                "project": "Приложение за лекари и медицински работници"
            }
        ],
        "allParticipants": 100,
        "teams": 18,
        "valuedProjects": 7,
        "description": "Проект за образователна игра, която ангажира дългосрочно играчите да се грижат за околната среда, спечели първата награда на ученическия хакатон в Технологично училище Електронни системи (ТУЕС) HackTUES 2. Състезанието се проведе от 9 до 11 октомври 2015 г. с участието на 18 отбора от ученици от 8 до 12 клас в ТУЕС, които разработваха проекти, подпомагащи опазването на околната среда и социални каузи.\n     Проектът за игра TreeHack с десктоп, мобилно и онлайн приложения, който спечели първо място в състезанието, е разработен от отбор ASDF Unicorns - Жанет Хаджиангелова, Мария Стоянова, Георги Данчев, Николай Миланов и Димитър Кацаров, ученици от 9 и 11 клас в ТУЕС.\n     Втора награда журито връчи на отбор Walking Chaos за проекта за уебсайт за продажба и обмен на продукти от рециклирани материали с функционалност за даряване на част от сумите от реализираните продажби.\n     Отбор The Tanks спечели трета награда за приложението за лекари и медицински работници MedHack, което предоставя информация за назначеното лечение и предписаните лекарства на пациентите, чрез разчитане на уникален баркод за всеки пациент. Специалната награда за най-добра презентация и наградата на Chaos Group беше връчена на отбор For Code Sake за приложението им за синхронизирано изпълнение на песни от няколко мобилни телефона. Отбор Pe6o получи специална награда от Astea Solutions за проекта си за игра, която чрез интеграция на различни технологии и приложения стимулира играчите да бъдат физически активни и да правят упражнения, за да подобрят представянето на своите онлайн герои. Отбор Fanatic спечели специалната награда на Microsoft за проект за приложение, което би улеснило електронното гласуване, чрез разчитане на лични карти и онлайн справка в база данни от избиратели. Осмокласниците от отбор Alfa спечелиха наградата на MusalaSoft за проекта си за уебсайт с информация за различни заболявания. Отборите, класирани на призовите три места получиха и награди от Delta.bg.\n     Второто издание на HackTUES - хакатон, организиран от ученици за ученици, затвърди успеха на първото състезание, което се проведе през м. юни тази година. Основната цел на HackTUES е да се даде възможност на ученици от различни класове да работят заедно и да придобият практически опит в създаването на софтуер, в работата в екип и в подкрепата на обществени каузи. HackTUES 2 е подкрепен отAstea Solutions, ChaosGroup, HackBulgaria, Microsoft, Obecto, SAP, Musala Soft, Delta.bgи Telerik, a Progress Company.Медиен партньор на хакатона е Socialevo.net. Събитието е част от Европейската седмица на програмирането (EU Code Week), която цели да популяризира програмирането сред широк кръг млади хора.\n„Хакатонът е поредното доказателство, че учениците винаги има с какво да ни изненадат. Чудесните идеи, разработени от учениците, правят това състезание уникално и няма съмнение, че HackTUES вече се превръща в една от добрите традиции в ТУЕС.“\nдоц. д-р инж. Стела Стефанова, директор на ТУЕС"
    },
    {
        "id": "hacktues3",
        "winners": [
            {
                "place": "first",
                "participants": "Лазар Френкев, Александър Вербовский, Андрей Стрински, Християн Генчев, Алекс Стефанов",
                "name": "Зор",
                "project": "2D Platformer с puzzle game елементи",
                "image": "https://firebasestorage.googleapis.com/v0/b/hack-tues.appspot.com/o/ht_archive%2Fht3%2Fht3-1.jpg?alt=media&token=7af0dd5d-558a-490f-9cbe-366603d70ebe"
            },
            {
                "place": "second",
                "participants": "Телерик Арсов, Стефан Бабуков, Николай Милчев, Мартин Дацев",
                "name": "To6o",
                "project": "Симулация на генетичен алгоритъм",
                "image": "https://firebasestorage.googleapis.com/v0/b/hack-tues.appspot.com/o/ht_archive%2Fht3%2Fht3-2.jpg?alt=media&token=56fe9595-09f0-47b4-bd4b-4f59bf001376"
            },
            {
                "place": "third",
                "participants": "Георги Корчаков, Кристиян Йочев, Йордан Златанов, Симеон Георгиев, Александър Стоичков",
                "name": "Top8",
                "project": "Уеб приложение за създаване и редактиране на изображения",
                "image": "https://firebasestorage.googleapis.com/v0/b/hack-tues.appspot.com/o/ht_archive%2Fht3%2Fht3-3.jpg?alt=media&token=8d29551b-5367-49c8-b929-a19410fb0aae"
            }
        ],
        "allParticipants": 136,
        "teams": 31,
        "valuedProjects": 8,
        "description": "Първото място в хакатона спечели забавната игра Artstealer на отбор Зор, създадена за Android. Симулацията на генетичен алгоритъм Micromanipulartor на десетокласниците от отбор To6o беше отличена с второ място. Третото място спечели проектът на отбор Тоp8 за уеб приложение за създаване и редактиране на изображения Image Maker, което работи на всякакви платформи. Освен наградите от организаторите на Hack TUES, трите отбора получиха и награди от партньорите на хакатона. Те ще могат да посетят и офисите на Dopamine, SAP, TelebidPro и VMware.\n     Големите победители от отбор Зор получиха и възможност да довършат проекта си с екип на TelebidPro, индивидуална сума за закупуване на хардуер, както и възможност за безплатно обучение в един семестър в SoftUni. Уеб приложението Tarina за споделено създаване на истории на отбор Pu6ki беше отличено със специалната награда на TelebidPro и възможност за финализиране на проекта. Такава възможност получи от VMware и проектът на отбор Костенурки Нинджа Project FUN – уебсайт за състезания с рисуване. Със специални награди от VMware бяха отличени и проектът на отбор Geko Snek Мотика Motors за робот с 4 колела и самостоятелно управление, както и проектът за социална мрежа за споделяне на креативни идеи Visual Delight на отбор To_si_e_za_nas. Проектът на робот, който рисува аналогови и цифрови схеми и платки по зададена картинка Made2Make на отбор Programartists беше отличен със специалната награда на SAP. Представителите на Dopamine връчиха и индивидуални награди на петима от участниците в хакатона – 24 инчови монитори.\n     В третото издание на ученическия хакатон участваха 136 ученика от 8-ми до 12-клас от ТУЕС, разпределени в 31 отбора. В продължение на три дни учениците работиха върху създаването на демонстрационни проекти на тема Art && Creativity. За реализацията на проектите допринесоха и 29-те ментори доброволци – завършили ТУЕС-ари и представители на партньорите на хакатона. Партньори на Hack TUES 3 са Dopamine, SAP, TelebidPro, VMware, Nemetschek Bulgaria, Astea Solutions, CloudBalkan, Musala Soft, Chaos Group и Smartcom Bulgaria.\n     Ученическият хакатон в ТУЕС се превърна в традиция от 2015 г. по инициатива на ученици от училището. Организацията на мащабното събитие през 2017 г. тази година се проведе от ученически екип от 11А клас, подкрепен от ръководството, преподавателите и персонала в ТУЕС, завършили ТУЕС-ари, както и ученици-доброволци от училището."
    },
    {
        "id": "hacktues30",
        "winners": [
            {
                "place": "first",
                "participants": "Телерик Арсов, Ивона Мирчева, Владислав Георгиев, Мартин Дацев, Петър Милев",
                "name": "COCOBE",
                "project": "Приложение за резюмиране на текст, използващо невронни мрежи и машинно самообучение",
                "image": "https://firebasestorage.googleapis.com/v0/b/hack-tues.appspot.com/o/ht_archive%2Fht30%2Fh30xt-1.jpg?alt=media&token=81998738-f4ce-4792-8406-7fe1313f6b8e"
            },
            {
                "place": "second",
                "participants": "Георги Любенов, Виктор Велев, Антон Янчев, Самуил Георгиев",
                "name": "Old and Bald",
                "project": "Приложение за чатбот на историческа тема, което предлага резюме на текстове по дадена тема, спрямо интересите на ползвателите",
                "image": "https://firebasestorage.googleapis.com/v0/b/hack-tues.appspot.com/o/ht_archive%2Fht30%2Fh30xt-2.jpg?alt=media&token=ac1a56a7-c38d-412d-8368-3c747db878e0"
            },
            {
                "place": "third",
                "participants": "Михаил Киров, Петър Николов, Денис Бързанов, Тони Пеловски, Стефан Стефанов",
                "name": "IDK",
                "project": "Игрална конзола",
                "image": "https://firebasestorage.googleapis.com/v0/b/hack-tues.appspot.com/o/ht_archive%2Fht30%2Fh30xt-3.jpg?alt=media&token=2ede6148-5de5-4582-be3c-32260577e382"
            }
        ],
        "allParticipants": 206,
        "teams": 45,
        "valuedProjects": 11,
        "description": "То е разработено от Телерик Арсов, Ивона Мирчева, Владислав Георгиев, Мартин Дацев и Петър Милев, ученици от 11Б клас. Отборът им КОКОБЕ взе и специалната награда на TelebidPro с възможност за стаж и менторство. Друг проект, базиран на машинно самообучение, спечели второто място в хакатона – приложение за чатбот на историческа тема, което предлага резюме на текстове по дадена тема, спрямо интересите на ползвателите. То е разработено от деветокласниците в ТУЕС от отбор Old and Bald - Георги Любенов, Виктор Велев, Антон Янчев и Самуил Георгиев. Третата награда е за проект за игрална конзола, която беше демонстрирана пред журито от отбор IDK- Михаил Киров, Петър Николов, Денис Бързанов, Тони Пеловски, Стефан Стефанов от 10Б. В четвъртото издание на тридневния ученически хакатон Hack 30xTUES участваха 45 отбора с ученици от 8-ми до 12-ти клас. Те създадоха софтуерни и хардуерни проекти по теми, свързани с 30-годишния юбилей на училището:\nБизнес, училище, университет, посветена на 3-те необходими елемента за успешно ИТ образование;\nDigital past – за възраждане на историята и интереса към миналото с помощта на технологиите;\n30xТУЕС – за проекти за честване на юбилея на училището.\n     Отборите победители получиха като награди възможност за закупуване на техника, награди отTelebidPro, SAP и Uber Engineering в София, както и посешение в офиса на SoftServe. Осем други отбора получиха специални награди за проектите си. Отбор Mamutite222 - Георги Стефанов, Самуил Иванов, Владислав Миленков, Стефан Гълъбов от 10-ти клас – бяха отличени от развойния център на SAP в София за проекта си за игра, вдъхновена от битката в Дюнкерк. Теодор Станишев от отбор Fluffy Bears получи персонална награда от ScaleFocus.\n     Осмокласниците от Autardia - Кристиян Стоименов, Стела Касабова, Виолета Кабаджова, Стефани Стайкова, Стефан Босев - получиха наградата на Софтуерния университет.Немечек България отличиха 12-токласниците от отбор Ime - Николай Станишев, Иван Милев и Иво Тодоров - за систематичния им подход в проекта им за игра в терминал. Отбор Why Not - Кристиян Стоименов, Калоян Ангелов, Виктория Радкова, Слав Кирилов и Християн Генчев - получиха награда от Статсофт за проект с вградени микрокомпютърни системи.\n     Проектът за текстов редактор на 9-токласниците от Project Hogwarts - Александър Стоичков, Иван Димитров, Кристиян Йочев, Георги Корчаков и Виктор Петров – беше отличен от Cloud Balkan. Награда от компанията получи и отбор Programming Zygotes - Милен Илиев, Михаил Колев, Антонио Такев, Валери Добрев и Николай Йончев – за проекта им за редактор разчитащ текст от снимка. Осмокласниците от Thunder System – Мартин Вайер, Боян Иванов, Мартин Врачев, Мартин Дамянов, Петър Дамянов – получиха награда от Live to Lift.\n     В журито на полуфиналите и финалите на хакатона участваха представители на компаниите-партньори, ИТ професионалисти, завършили ТУЕС, и преподаватели от училището. Спонсори на юбилейното издание Hack 30xTUES са развойният център на SAP в София,SoftServe, TelebidPro, VMware, Dopamine, ScaleFocus, Софтуерен Университет, Accedia, Astea Solutions, Немечек България и Uber Engineering в София. Партньори в организацията на събитието са София Тех Парк, Смартком - България АД, init Lab, Cloud Balkan и Пирин Спринг. В хакатона участваха почти половината настоящите ученици в ТУЕС. В работата им помагаха над 40 ИТ професионалисти като ментори - представители на компаниите-партньори, експерти, завършили училището преди години и преподаватели. Събитието беше организирано от екип от около 30 ученици, доброволци и представители на Асоциацията на завършилите ТУЕС. Hack 30xTUES е уникално събитие не само, защото е организирано от ученици за ученици, но и защото дава на участниците възможност за изява, незабравими спомени и мотивация за развитие. Учениците придобиват нови знания, умения за работа в екип, комуникационни и презентационни умения, както и ценни контакти с ИТ професионалисти."
    },
    {
        "id": "hacktues365",
        "winners": [
            {
                "place": "first",
                "participants": "Виктор Велев, Петър Герасимов, Теодор Станишев",
                "name": "Elsyser",
                "project": "Персонален асистент целящ да промени живота на незрящите като използва Artificial intelligence",
                "image": "https://firebasestorage.googleapis.com/v0/b/hack-tues.appspot.com/o/ht_archive%2Fht365%2Fht365-1.jpg?alt=media&token=fdf5b6b6-981c-49e7-a5d4-efe4c00a7990"
            },
            {
                "place": "second",
                "participants": "Владислав Георгиев, Мартин Дацев, Антонио Милев, Телерик Арсов",
                "name": "Какводой",
                "project": "Платформа за решаване на геометрични задачи",
                "image": "https://firebasestorage.googleapis.com/v0/b/hack-tues.appspot.com/o/ht_archive%2Fht365%2Fht365-2.jpg?alt=media&token=64557df6-b2d4-455d-aca0-3ccac3543a40"
            },
            {
                "place": "third",
                "participants": "Мартин Йорданов, Самуил Георгиев, Антон Янчев, Огнян Барух, Георги Любенов",
                "name": "Babba4e",
                "project": "Система за проверка на автентичността на продукта чрез сканиране на уникален QR код на всеки продукт",
                "image": "https://firebasestorage.googleapis.com/v0/b/hack-tues.appspot.com/o/ht_archive%2Fht365%2Fht365-3.jpg?alt=media&token=99e63270-7e9e-4f97-94d4-3046bdc05037"
            }
        ],
        "allParticipants": 198,
        "teams": 43,
        "valuedProjects": 10,
        "description": "Вградено устройство с камера и изкуствен интелект в помощ на незрящите хора спечели първа награда в петия ученически хакатон HackTUES 365 на Технологично училище „Електронни системи“ (ТУЕС) към Технически университет – София. Устройството VoiceCV, създадено от отбор „Elsyser“ - Виктор Велев от 10 клас, Петър Герасимов и Теодор Станишев от 12 клас, може да се интегрира в шапка или очила и играе ролята на личен асистент, който информира с глас за околните обекти чрез снимки в близка и далечна перспектива. Отборът получи и специалните награди на ScaleFocus, Дроксик и Data Science Society.\n     Специалната награда за проект с вградена микрокомпютърна технология, която се връчва за първи път в HackTUES, получи системата S.P.A.S. (Smart Personal Assistant System) за отдалечено управление на устройства в дома или офиса през мобилен телефон. Проектът е разработен от Искрен Александров от 8 клас и Ангел Стоянов, Мартин Вайер, Мартин Георгиев и Денис Захариев от 9 клас, от отбор „Телефона в сака“. Наградата е осигурена от Комет Електроникс.\n     Втора награда в хакатона спечели приложението за решаване на геометрични задачи GeoSolver. То сканира условието и генерира електронен чертеж и решение на задачата. Разработката е дело на 12-токласниците Телерик Арсов, Мартин Дацев, Антонио Милев, Владислав Георгиев и Петър Милев от отбор „Какводой“. Момчетата получиха и специална награда от Data Science Society.\n     Трета награда в хакатона спечели отбор „Бабич“ за проекта Product Chain, използващ блокчейн технология, за да предпази потребителите от фалшиви стоки на пазара. Мартин Йорданов от 11 клас и Самуил Георгиев, Антон Янчев, Огнян Барух и Георги Любенов от 10 клас разработиха система за проследяване на автентичността на продукти в търговската мрежа, чрез уникален QR код, който дава информация за пътя на продукта. Те спечелиха и специална награда от TelebidPro.\n     Още шест други проекта спечелиха специални награди в тазгодишното издание на HackTUES. Състезанието се проведе от 15 до 17 март 2019 г. в ТУЕС и София Тех Парк. В него участваха 200 ученици от 8-ми до 12-ти клас на ТУЕС, разпределени в 43 отбора. Над 60 ИТ професионалисти от различни компании, много от които възпитаници на училището, бяха ментори и членове на журито. Хакатонът се организира от екип от доброволци от 11 клас с подкрепата на Асоциацията на завършилите ТУЕС и ръководството на ТУЕС. За поредна година водещи технологични компании подкрепят провеждането на ученическото ИТ състезание HackTUES. Това са SAP, SoftServe, TelebidPro, VMware, Droxic, Progress, ScaleFocus, Astea Solutions, DevriX, Dopamine, Nemetschek Bulgaria. Технологични партньори на събитието тази година са София Тех Парк, Комет Електроникс, Смартком - България, Булгед, Cloud Balkan, Data Science Society и init Lab. Кетеринг партньори на хакатона са CoKitchen, Aristeon.bg, Delishu, Domino’s, Пекарчето на татко, Pura Vida Organic Farm, Pure Water, Работилничка за сладки моменти и сладкар Ирина Иванова. Събитието беше подкрепено и от Ротари Клуб София Капитал, DevStyler и YoungArtist.\n     „Учениците от ТУЕС отново доказаха, че за тях няма неосъществими идеи.“ – каза доц. д-р инж. Стела Стефанова, директор на Технологично училище „Електронни системи“ към ТУ - София. „Журито и професионалистите са силно впечатлени от факта, че в хакатона се разработват проекти, използващи най-новите технологии. В последните години силно впечатление правят решения с невронни мрежи и изкуствен интелект, проекти с вградени микрокомпютърни системи и IoT, а ето че тази година има и проект с блокчейн технология. Надяваме се, че всяка следваща година конкуренцията между отборите ще става още по-голяма и новите технологии ще са част от HackTUES“. Преобладаващата част от проектите – финалисти в HackTUES 365 комбинират софтуерни, мрежови и хардуерни решения.\n     Сред основните ползи от участието си в хакатона учениците посочват възможността да опознаят и тестват нови технологии, да работят с професионалисти като ментори, да се научат да работят в екип и да представят идеите си, както и да открият конкретни насоки за бъдещото си професионално развитие. Ученици от ТУЕС редовно печелят награди и в хакатони за професионалисти и студенти, като Спортния хакатон, Балканския хакатон, Хакатон за София, хакатона, посветен на 10-годишнината от членството на България в ЕС и др. Членовете на отбора победител „Elsyser“ наскоро спечелиха хакатона на Студентския клуб на Американския университет в България и са носители на различни отличия от други хакатони за професионалисти. Част от членовете на отбора, заел второ място „Какводой“, са най-награждаваната група ученици в историята на HackTUES, като неизменно са сред лауреатите на хакатона"
    }
  ]
