import React from 'react'
import Panel from '../../components/regulation/panel'

export default function Regulation() {
    return (
        <div>
            <Panel title="Hello" description="Във връзка с продължаващата опасност от COVID-19, Hack TUES 6 ще се проведе в хибриден формат:
официалното откриване, финалът и церемонията по награждаване на хакатона ще се проведат на живо при спазване на всички необходими противоепидемични мерки;
работата по проектите и оценяването на четвърт- и полуфинали ще се организира изцяло онлайн.
До участие на живо ще бъдат допуснати единствено ученици във видимо добро здравословно състояние, които спазват въведените противоепидемични мерки.
Участници, които не спазват наложените предпазни мерки, могат да бъдат изгонени.
Участници в Hack TUES 6, които са под двуседмична карантина поради потвърден случай на COVID-19 или контакт със заразено лице са длъжни да участват в хакатона изцяло онлайн. Те ще могат да наблюдават церемониите по откриване и награждаване онлайн и ще имат възможност да представят проектите си онлайн пред журито на финала, ако са номинирани за него.
Всеки участник, който има притеснения да присъства на живо, ще може също да избере да участва изцяло онлайн, като отбележи тази опция, когато се регистрира в сайта на събитието;
До участие на живо ще бъдат допуснати следните участници:
Официално откриване:
участниците, които са се записали за лекцията, която ще се проведе след откриването - броят на местата е ограничен, като записването ще бъде преустановено след изчерпване на местата.
Подготвящи уъркшопи:
участниците, които са се регистрирали за съответния уъркшоп. Те ще се проведат след лекцията - броят на местата е ограничен, като записването ще бъде преустановено след изчерпване на местата.
Финал:
отборите, които са номинирани за участие във финала.
Церемония по награждаване:
отборите-финалисти и
отбори, номинирани за награда (важно е да отбележим, че отбори, които не са номинирани, също могат да получат специална награда от Hack TUES 6);
При влошаване на COVID-19 ситуацията, Hack TUES 6 ще се проведе изцяло в онлайн формат. За всички подобни промени, учениците, регистрирали се за участие ще бъдат уведомени своевременно."/>
        </div>
    )
}
